Conf.Simple/src/InformationRegisters/SUI_ВладельцыНастроекДокументов/SUI_ВладельцыНастроекДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ВладельцыНастроекДокументов</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/InformationRegisters/SUI_ВладельцыНастроекДокументов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияДанныеЗаполнения = Тип("Структура") И Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ЗаполнитьВсемиПоУстановленномуОтбору();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВсемиПоУстановленномуОтбору()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МобильныеУстройства.Ссылка КАК МобильноеУстройство,
		|	НастройкиДокументов.Ссылка КАК НастройкаДокумента
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства,
		|	Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументов
		|ГДЕ
		|	НЕ МобильныеУстройства.ЭтотУзел
		|	И ВЫБОР
		|		КОГДА &МобильноеУстройство = НЕОПРЕДЕЛЕНО
		|		ИЛИ &МобильноеУстройство = ЗНАЧЕНИЕ(ПланОбмена.SUI_МобильныеУстройства.ПустаяСсылка)
		|			ТОГДА НЕ МобильныеУстройства.ПометкаУдаления
		|		ИНАЧЕ МобильныеУстройства.Ссылка = &МобильноеУстройство
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента = НЕОПРЕДЕЛЕНО
		|		ИЛИ &НастройкаДокумента = ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументовОбмена.ПустаяСсылка)
		|			ТОГДА НастройкиДокументов.Используется
		|			И НЕ НастройкиДокументов.ПометкаУдаления
		|		ИНАЧЕ НастройкиДокументов.Ссылка = &НастройкаДокумента
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", Отбор.МобильноеУстройство.Значение);
	Запрос.УстановитьПараметр("НастройкаДокумента", Отбор.НастройкаДокумента.Значение);
	
	Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
